In [1]:
import pandas as pd

In [4]:
s1 = pd.Series([0,1], index = ['a', 'b'])
s2 = pd.Series([2,3,4], index = ['c', 'd', 'e'])
s1, s2

(a    0
 b    1
 dtype: int64,
 c    2
 d    3
 e    4
 dtype: int64)

In [6]:
s3 = pd.concat([s1, s2])
s3

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [11]:
df1 = pd.DataFrame([['Dog', 3], ['Bird', 10], ['Tiger', 6], ['Moose', 3]], index = [0,1,2,3], columns=['동물', '나이'])
df1

      동물  나이
0    Dog   3
1   Bird  10
2  Tiger   6
3  Moose   3

In [13]:
df2 = pd.DataFrame([['집', 0], ['초원', 0], ['수풀', 0], ['초원', 1]], index = [0,1,2,3], columns=['사는곳', '뿔의 개수'])
df2

  사는곳  뿔의 개수
0   집      0
1  초원      0
2  수풀      0
3  초원      1

In [14]:
pd.concat([df1, df2], axis=1)

      동물  나이 사는곳  뿔의 개수
0    Dog   3   집      0
1   Bird  10  초원      0
2  Tiger   6  수풀      0
3  Moose   3  초원      1